from typing import List

def insertion_sort(arr: List[int]) -> None:
    """
    Реалізує сортування вставками.

    Алгоритм працює за принципом поступового вставлення кожного елемента 
    в правильну позицію у вже відсортованій частині масиву.

    Складність:
    - Найгірший випадок: O(n²)
    - Найкращий випадок: O(n) (коли масив майже відсортований)
    - Середній випадок: O(n²)

    Args:
        arr (List[int]): Масив, який потрібно відсортувати.

    Returns:
        None: Сортування відбувається на місці.
    """
    for i in range(1, len(arr)):
        key = arr[i]
        j = i - 1
        while j >= 0 and key < arr[j]:
            arr[j + 1] = arr[j]
            j -= 1
        arr[j + 1] = key
